# Pandas dataframe eleman i≈ülemleri

In [1]:
import pandas as pd
import numpy as np

In [2]:
a=np.arange(1,10).reshape(3,3)

In [3]:
a

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [6]:
pan=pd.DataFrame(a,columns=["a","b","c"])

In [7]:
pan

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [8]:
sozluk={"var1":a}

In [9]:
sozluk

{'var1': array([[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]])}

In [12]:
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)

In [13]:
sozluk={"var1":s1,"var2":s2,"var3":s3}

In [14]:
df=pd.DataFrame(sozluk)

In [15]:
df

   var1  var2  var3
0     8     1     7
1     3     3     3
2     1     9     1
3     2     0     5
4     3     4     8

In [16]:
df[0:1]

   var1  var2  var3
0     8     1     7

In [17]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [18]:
df.values

array([[8, 1, 7],
       [3, 3, 3],
       [1, 9, 1],
       [2, 0, 5],
       [3, 4, 8]])

In [19]:
df.head()

   var1  var2  var3
0     8     1     7
1     3     3     3
2     1     9     1
3     2     0     5
4     3     4     8

In [20]:
df.tail()

   var1  var2  var3
0     8     1     7
1     3     3     3
2     1     9     1
3     2     0     5
4     3     4     8

In [22]:
df.index=["a","b","c","d","e"]

In [23]:
df

   var1  var2  var3
a     8     1     7
b     3     3     3
c     1     9     1
d     2     0     5
e     3     4     8

## silme i≈ülemi

In [24]:
df.drop("a", axis =0)

   var1  var2  var3
b     3     3     3
c     1     9     1
d     2     0     5
e     3     4     8

In [25]:
df

   var1  var2  var3
a     8     1     7
b     3     3     3
c     1     9     1
d     2     0     5
e     3     4     8

In [26]:
df.drop("a", axis =0, inplace=True)

In [27]:
df

   var1  var2  var3
b     3     3     3
c     1     9     1
d     2     0     5
e     3     4     8

## fancy ile silme

In [28]:
l=["c","e"]

In [29]:
df.drop(l,axis=0)

   var1  var2  var3
b     3     3     3
d     2     0     5

In [31]:
"var1" in df

True

In [34]:
ss="var1"

In [35]:
ss in df

True

In [39]:
ss="var1","var2"

In [40]:
ss in df

False

In [41]:
ss=["var1","var2"]

In [43]:
for i in ss:
    print(i in df)

True
True

In [44]:
df["var4"] = df["var1"]*df["var2"]

In [45]:
df

   var1  var2  var3  var4
b     3     3     3     9
c     1     9     1     9
d     2     0     5     0
e     3     4     8    12

In [47]:
df.drop("var4",axis=1,inplace=True)

In [48]:
df

   var1  var2  var3
b     3     3     3
c     1     9     1
d     2     0     5
e     3     4     8

## G√∂zlem ve Deƒüi≈üken se√ßimi (loc ve iloc)

In [49]:
import numpy as np
import pandas as pd

m=np.random.randint(1,30,size=(10,3))
df=pd.DataFrame(m,columns=["var1","var2","var3"])

In [50]:
df

   var1  var2  var3
0    21    21    29
1    21    15     9
2    29    11    18
3    24    21    14
4    18     6    12
5    11    11    26
6    13     8    20
7     3    24    21
8     6     8    18
9    16    11     7

## loc: tanƒ±mlandƒ±ƒüƒ± ≈üekli ile se√ßim yapmak i√ßin kullanƒ±lƒ±r

In [51]:
df.loc[0:3]

   var1  var2  var3
0    21    21    29
1    21    15     9
2    29    11    18
3    24    21    14

## iloc : alƒ±≈üƒ±k olduƒüumuz indexleme mantƒ±ƒüƒ± ile se√ßim yapar

In [52]:
df.iloc[0:3]

   var1  var2  var3
0    21    21    29
1    21    15     9
2    29    11    18

In [53]:
df.iloc[0,0]

21

In [54]:
df.iloc[:3,:2]

   var1  var2
0    21    21
1    21    15
2    29    11

In [55]:
df.loc[0:3,"var3"]

0    29
1     9
2    18
3    14
Name: var3, dtype: int32

In [57]:
df.iloc[0:3]["var3"]

0    29
1     9
2    18
Name: var3, dtype: int32

## ko≈üullu eleman i≈ülemleri

In [58]:
df

   var1  var2  var3
0    21    21    29
1    21    15     9
2    29    11    18
3    24    21    14
4    18     6    12
5    11    11    26
6    13     8    20
7     3    24    21
8     6     8    18
9    16    11     7

In [60]:
df["var2"][2:5]

2    11
3    21
4     6
Name: var2, dtype: int32

In [63]:
df[df.var1>15]

   var1  var2  var3
0    21    21    29
1    21    15     9
2    29    11    18
3    24    21    14
4    18     6    12
9    16    11     7

In [65]:
df[(df.var1>15)&(df.var3<15)]

   var1  var2  var3
1    21    15     9
3    24    21    14
4    18     6    12
9    16    11     7

In [67]:
df.loc[(df.var1>15),["var1","var2"]]

   var1  var2
0    21    21
1    21    15
2    29    11
3    24    21
4    18     6
9    16    11

# Birle≈ütirme Join ƒ∞≈ülemi

In [68]:
df

   var1  var2  var3
0    21    21    29
1    21    15     9
2    29    11    18
3    24    21    14
4    18     6    12
5    11    11    26
6    13     8    20
7     3    24    21
8     6     8    18
9    16    11     7

In [70]:
df2= df+13

In [71]:
df2

   var1  var2  var3
0    34    34    42
1    34    28    22
2    42    24    31
3    37    34    27
4    31    19    25
5    24    24    39
6    26    21    33
7    16    37    34
8    19    21    31
9    29    24    20

In [81]:
pd.concat([df2,df],ignore_index=True)

    var1  var2  var3
0     34    34    42
1     34    28    22
2     42    24    31
3     37    34    27
4     31    19    25
5     24    24    39
6     26    21    33
7     16    37    34
8     19    21    31
9     29    24    20
10    21    21    29
11    21    15     9
12    29    11    18
13    24    21    14
14    18     6    12
15    11    11    26
16    13     8    20
17     3    24    21
18     6     8    18
19    16    11     7

In [84]:
a=np.random.randint(30,size=(5,3))
b=np.random.randint(30,size=(5,3))

In [86]:
df1=pd.DataFrame(a,columns=["var1","var2","var3"])

In [87]:
df2=pd.DataFrame(b,columns=["var4","var2","var3"])

In [88]:
df1

   var1  var2  var3
0    22     6    20
1    16    10    13
2    23     8     5
3    18    22    10
4    21     4    14

In [89]:
df2

   var4  var2  var3
0    24     2    16
1    21    26    14
2    13    16    25
3    13    26     3
4    29    25    26

## farklƒ± bilgiler i√ßeren veri setlerinin birle≈ütirilmesi

In [90]:
pd.concat([df1,df2])

   var1  var2  var3  var4
0  22.0     6    20   NaN
1  16.0    10    13   NaN
2  23.0     8     5   NaN
3  18.0    22    10   NaN
4  21.0     4    14   NaN
0   NaN     2    16  24.0
1   NaN    26    14  21.0
2   NaN    16    25  13.0
3   NaN    26     3  13.0
4   NaN    25    26  29.0

In [92]:
pd.concat([df1,df2],join="inner",ignore_index=True)

   var2  var3
0     6    20
1    10    13
2     8     5
3    22    10
4     4    14
5     2    16
6    26    14
7    16    25
8    26     3
9    25    26